---
kind: method
id: M:Autodesk.Revit.DB.TessellatedShapeBuilder.Clear
source: html/8c2cd942-f8c3-3288-bac6-8d4d1f064714.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilder.Clear Method

Erases all face set and clears the logs, if any.

## Syntax (C#)
```csharp
public void Clear()
```

## Remarks
This function can be safely called upon builder without an open face set.